# Transform2D Constructor (UV, UV, UV) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D Constructor (UV, UV, UV)
Transform2D Class See Also
---
Constructs the transformation by specifying the vectors and the origin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform2D(
	UV uVec,
	UV vVec,
	UV origin
)
```

Visual Basic
---
```text
Public Sub New ( _
	uVec As UV, _
	vVec As UV, _
	origin As UV _
)
```

Visual C++
---
```text
public:
Transform2D(
	UV^ uVec,
	UV^ vVec,
	UV^ origin
)
```

# ### Parameters
uVec
    Type: Autodesk.Revit.DB..::..UV The image of (1, 0) under OfVector(UV).
vVec
    Type: Autodesk.Revit.DB..::..UV The image of (0, 1) under OfVector(UV).
origin
    Type: Autodesk.Revit.DB..::..UV The image of (0, 0) under OfPoint(UV). This defines the translational part of the transform.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Transform2D Class
Transform2D Overload
Autodesk.Revit.DB Namespace